#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//作业：统计二进制中1的个数
//int count_bit_one(int n)//这个程序有点问题
//{
//	int count = 0;
//
//	while (n)
//	{
//		if (n % 2 == 1)
//		{
//			count++;
//		}
//		n = n / 2;
//	}
//
//	return count;
//}
//
//int main()
//{
//	int a = 0;
//	scanf("%d",&a);
//	//写一个函数求a的二进制（补码）表示中有几个1
//	int count = count_bit_one(a);
//	//13
//	//00000000 00000000 00000000 00001101--原码
//	//00000000 00000000 00000000 00001101--反码     正数的原码=反码=补码
//	//00000000 00000000 00000000 00001101--补码
//	printf("count=%d\n", count);
//
//	return 0;
//}

//int count_bit_one(unsigned int n)//对上面的程序修改后，没问题了
//{
//	int count = 0;
//
//	while (n)
//	{
//		if (n % 2 == 1)
//		{
//			count++;
//		}
//		n = n / 2;
//	}
//
//	return count;
//}
//
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	//写一个函数求a的二进制（补码）表示中有几个1
//	int count = count_bit_one(a);
//	//13
//	//00000000 00000000 00000000 00001101--原码
//	//00000000 00000000 00000000 00001101--反码     正数的原码=反码=补码
//	//00000000 00000000 00000000 00001101--补码
//
//	//-1
//	//10000000 00000000 00000000 00000001--原码
//	//11111111 11111111 11111111 11111110--反码
//	//11111111 11111111 11111111 11111111--补码
//	printf("count=%d\n", count);
//
//	return 0;
//}


//第二种方法
//int count_bit_one(int n)
//{
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < 32; i++)//最多移动31位就行
//	{
//		if (((n >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//
//	return count;
//}
//
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	//写一个函数求a的二进制（补码）表示中有几个1
//	int count = count_bit_one(a);
//	//13
//	//00000000 00000000 00000000 00001101--原码
//	//00000000 00000000 00000000 00001101--反码     正数的原码=反码=补码
//	//00000000 00000000 00000000 00001101--补码
//	printf("count=%d\n", count);
//
//	return 0;
//}

//第三种方法
int count_bit_one(int n)
{
	int count = 0;
	while (n)
	{
		n = n&(n - 1);
		count++;
	}

	return count;
}
//n=n&(n-1)   这个方法太难想到了，n=n&(n-1)每执行一次就让最右边的1消失了
//n
//13
//1101   n
//1100   n-1
//1100   n
//1011   n-1
//1000   n
//0111   n-1
//0000   n


int main()
{
	int a = 0;
	scanf("%d", &a);
	//写一个函数求a的二进制（补码）表示中有几个1
	int count = count_bit_one(a);
	//13
	//00000000 00000000 00000000 00001101--原码
	//00000000 00000000 00000000 00001101--反码     正数的原码=反码=补码
	//00000000 00000000 00000000 00001101--补码
	printf("count=%d\n", count);

	return 0;
}