#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//int main()//这个题目挺难的，看视频吧
//{
//	char a= -1;
//	//10000000 00000000 00000000 00000001 原码
//	//11111111 11111111 11111111 11111110 反码
//	//11111111 11111111 11111111 11111111 补码
//	//11111111 补码(因为a是char型，只能储存一个字节，所以只能取8位)
//	//11111111 11111111 11111111 11111111 补码（因为要打印整型，所以要发生整型提升，这个就是整型提升后的结果，
//	                                      //整型提升后还是补码）有符号进行整型提升前面加符号位，符号位是1就加1，符号位是0就加0
//	//11111111 11111111 11111111 11111110 反码
//	//10000000 00000000 00000000 00000001 原码
//	//打印的是原码：10000000 00000000 00000000 00000001
//	//10000000 00000000 00000000 00000001的十进制是-1
//	signed char b= -1;
//	//b和a是一样的
//	unsigned char c = -1;
//	//10000000 00000000 00000000 00000001 原码
//	//11111111 11111111 11111111 11111110 反码
//	//11111111 11111111 11111111 11111111 补码
//	//11111111 补码(因为a是char型，只能储存一个字节，所以只能取8位)
//	//00000000 00000000 00000000 11111111 补码（因为要打印整型，所以要发生整型提升，这个就是整型提升后的结果，
//	                                       //整型提升后还是补码）无符号进行整型提升前面加0
//	//因为高位是0 ，所以是个正数，正数的原码=反码=补码
//	//打印的是原码：00000000 00000000 00000000 11111111
//	//00000000 00000000 00000000 11111111的十进制是255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//
//	return 0;
//}

int main()
{
	char a = -128;
	//10000000 00000000 00000000 10000000 原码
	//11111111 11111111 11111111 01111111 反码
	//11111111 11111111 11111111 10000000 补码
	//10000000 补码(因为a是char型，只能储存一个字节，所以只能取8位)
	//11111111 11111111 11111111 10000000 补码（因为要打印无符号整型，所以要发生整型提升，这个就是整型提升后的结果，整型提升后还是补码）
	//有符号进行整型提升前面加符号位，符号位是1就加1，符号位是0就加0
	//又因为是无符号整型打印，所以原码=反码=补码
	//打印的是原码：11111111 11111111 11111111 10000000
	//11111111 11111111 11111111 10000000的十进制是：4294967168

	printf("%u\n", a);
	//%d   打印十进制的有符号整型数字
	//%u   打印十进制的无符号整型数字
	return 0;
}